#language: ru
@2
Функционал: Поиск на авито

  Структура сценария: Найдем <value> на авито
    Пусть открыт ресурс авито
    И в выпадающем списке категорий выбрана <category>
    И в поле поиска введено значение <value>
    И активирован чекбокс только с фотографией
    Тогда кликнуть по выпадающему списку региона
    Тогда в поле регион введено значение <region>
    И нажата кнопка показать объявления
    Тогда открылась страница результата по запросу <value>
    И в выпадающем списке сортировка значения <sortP>
    И в консоль выведено значение названия и цены <num> первых товаров
    Примеры:
      | value            | region        | num | category    | sortP   |
      | 'принтер'        | 'Владивосток' | 3   | электроника | дороже  |
      | 'huawei p50 pro' | 'Москва'      | 2   | телефоны    | дешевле |